print('Забавная история')
print()
h=int(input("""Одним дивным-дивным вечером девушка прогуливалась по центру города.
Вдруг она заметила какое-то движение в с свою сторону. Это был человек странной внешности.
1-Не обращать внимания и пройти мимо
2-Проявить интерес к нему.
(введите цифру вашего ответа)- """))
if h==1:
	print("Не раскрыв тайну личности, врнуться домой")
elif h==2:
	print('')
	q=int(input("""Девушка остановилась, чтобы разглядеть его. Проблемы заключалась в том, что из-за солнца, 
которое было еще со сторон спины, не было видно человека
1-надеть очки
2-тупо пялиться, сжигая глаза, на 'тень'
-"""))


	if q==1:
		w=int(input(""""Этот объект приблизился к ней и остановился. Её поверг шок от того кто перед ней. Ведь это...
1-Фатиг
2-Одногруппник
3-Звезда
-"""))
		if w==1:
			print('Эй, твой лебл - херня')
		elif w==2:
			print('Сказать, что его отчислили и уйти')
		elif w==3:
			e=int(input("""Это оказлся МИХАЙЛОВ.Мужчина остановился. Попровил свои длинные завитые волосы, он проевел своей мощной левой рукой по груди, задвая блестки волосиками
и очень внимательно посмотрел на девушку. Издали ему показалось, что Алла, но он ошибся.
1-Начать задавать вопросы
2-Устремить взгляд вперед и уехать
-"""))
		if e==2:
			print('Закончить арку')
		elif e==1:
			t=int(input("""Неожиданно для девушки, он стал задавть вопрос про конференции её матери, про отца и многое другое, связанное с её семьёй
1-Запаниковать и уйти
2-Выслушать вопросы и вскользь отвечать на вопросы
-"""))
		if t==1:
			print('Закончить арку')
		elif t==2:
			print('Узнав ответы на свои вопросы, мужчина встал на детский самокат и уехал в закат')



	elif q==2:
		w=int(input(""""Этот объект приблизился к ней и остановился. Её поверг шок от того кто перед ней. Ведь это...
1-Фатиг
2-Одногруппник
3-Звезда
-"""))
		if w==1:
			print('Эй, твой лебл - херня')
		elif w==2:
			print('Сказать, что его отчислили и уйти')
		elif w==3:
			e=int(input("""Это оказлся КИРКОРОВ.Мужчина остановился. Попровил свои длинные завитые волосы, он проевел своей мощной левой рукой по груди, задвая блестки волосиками
и очень внимательно посмотрел на девушку. Издали ему показалось, что Алла, но он ошибся.
1-Начать задавать вопросы
2-Устремить взгляд вперед и уехать
-"""))
		if e==2:
			print('Закончить арку')
		elif e==1:
			t=int(input("""Неожиданно для девушки, он стал задавть вопрос про конференции её матери, про отца и многое другое, связанное с её семьёй
1-Запаниковать и уйти
2-Выслушать вопросы и вскользь отвечать на вопросы
-"""))
		if t==1:
			print('Закончить арку')
		elif t==2:
			print('Узнав ответы на свои вопросы, мужчина встал на детский самокат и уехал в закат')